module.exports = {
    // Ошибки авторизации и регистрации
    USER_NOT_AUTH: 'Внимание! Пользователь не авторизован!',
    USER_REGISTERED_SUCCESS: 'Пользователь успешно зарегистрирован!',
    USER_NOT_REGISTERED: 'Внимание! Ошибка регистрации!',
    USER_ALREADY_EXISTS: 'Пользователь с таким email уже существует!',
    INCORRECT_DATA_FORM: 'Внимание! Не корректные данные формы!',

    // Результаты входа/выхода
    AUTH_SUCCESS: 'Пользователь авторизован',
    AUTH_FAIL: 'Пользователь не авторизован',
    LOGOUT_SUCCESS: 'Вы успешно вышли из системы',

    // Товары
    PRODUCTS_LOADED: 'Список товаров получен',
    PRODUCT_FOUND: 'Товар найден',
    PRODUCT_NOT_FOUND: 'Товар не найден',

    // Общие операции
    SUCCESS_OPERATION: 'Операция выполнена успешно!',
    ERROR_OPERATION: 'Внимание! Серверная ошибка!'
}